{
  "backend/main.mo": "Empty Motoko actor with no backend logic implemented.",
  "feature_evidence.json": "Feature evidence report listing deployment-related features, associated files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/DEPLOYMENT.md": "Mainnet deployment guide with prerequisites, build steps, commands, and URL verification instructions.",
  "frontend/index.css": "Tailwind base styles and theme variables defining light/dark color palettes and shared UI styling.",
  "frontend/index.html": "HTML entrypoint loading fonts, metadata, and mounting the React application.",
  "frontend/LIVE_URL.md": "File intended to store the production deployment's stable HTTPS URL and verification notes.",
  "frontend/scripts/deploy-mainnet.sh": "Shell script that builds the frontend, deploys canisters to mainnet, and prints the resulting live URL.",
  "frontend/scripts/verify-live-url.sh": "Script that checks availability of the live URL and provides troubleshooting guidance based on HTTP status.",
  "frontend/src/App.tsx": "Main React app component handling personalization, presentation mode, yes/no flow, celebrations, and section rendering.",
  "frontend/src/components/AmbientBackground.tsx": "Renders a decorative background with floating hearts/sparkles when enabled.",
  "frontend/src/components/AudioToggle.tsx": "Button with tooltip that toggles background music using a custom audio hook.",
  "frontend/src/components/CelebrationLayer.tsx": "Generates falling heart particles for an on-screen celebration effect.",
  "frontend/src/components/CopyLinkButton.tsx": "Button that copies the current page URL using clipboard API with fallback and shows a tooltip and copied state.",
  "frontend/src/components/PersonalizationPanel.tsx": "Editable settings panel for customizing names, text, reasons, and memories using tabs and local storage state.",
  "frontend/src/components/PresentationModeToggle.tsx": "Toggle button with tooltip to switch presentation mode on or off.",
  "frontend/src/components/sections/LoveLetterCard.tsx": "Expandable card displaying a love letter that opens and closes with animations.",
  "frontend/src/components/sections/MemoryTimeline.tsx": "Accordion-based timeline listing memories with titles, dates, and descriptions.",
  "frontend/src/components/sections/ReasonsList.tsx": "Progressively reveals a list of reasons with cards and a button to show the next item.",
  "frontend/src/components/YesNoPrompt.tsx": "Yes/No prompt where the No button moves randomly and messages change while Yes triggers a callback.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages an authenticated or anonymous backend actor and refreshes dependent queries.",
  "frontend/src/hooks/useAudioPlayer.ts": "Hook providing play, pause, and toggle controls for looping audio with load and play state tracking.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for Internet Identity login, identity management, and AuthClient setup.",
  "frontend/src/hooks/useLocalStorageState.ts": "Defines a personalization state hook that loads, saves, updates, and resets user customization data using localStorage.",
  "frontend/src/hooks/useQueries.ts": "Provides an empty placeholder module noting that all state is managed client‑side.",
  "frontend/src/index.css": "Configures Tailwind base styles and a Valentine-themed color palette with custom utility classes and animations.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, radii, shadows, and animations including Valentine-specific theme values.",
  "project_state.json": "Stores project metadata, feature status, and deployment-related requirements for the Internet Computer app."
}